In [1]:
import pandas as pd

#1. Write a Pandas program to convert a Pandas module Series to Python list and
#its type.

series = pd.Series(data=[1,2,3,4,5])
series = list(series)
series

[1, 2, 3, 4, 5]

In [4]:
#2. Write a Pandas program to add, subtract, multiple and divide two Pandas
#Series.
s1 = pd.Series(data=[2, 4, 6, 8, 10])
s2 = pd.Series(data=[1, 3, 5, 7, 9])

print(s1+s2, s1-s2, s1*s2, s1/s2)

0     3
1     7
2    11
3    15
4    19
dtype: int64 0    1
1    1
2    1
3    1
4    1
dtype: int64 0     2
1    12
2    30
3    56
4    90
dtype: int64 0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [10]:
#3. Write a Pandas program to convert Series of lists to one Series.
s0 = pd.Series(data=['Red', 'Green', 'White'])
s1 = pd.Series(data=['Red', 'Black'])
s2 = pd.Series(data=['Yellow'])

s = s0.append([s1,s2])
print(s)

0       Red
1     Green
2     White
0       Red
1     Black
0    Yellow
dtype: object

In [14]:
#4. Write a Pandas program to create the mean and standard deviation of the
#data of a given Series.

s = pd.Series(data=[2, 4, 6, 8, 10])
print(f'{"s"} has mean {s.mean()} and standard deviation {s.std():.2f}')

s has mean 6.0 and standard deviation 3.16

In [21]:
#5. Write a Pandas program to get the first 3 rows of a given DataFrame.

nba = pd.read_csv('nba.csv')
nba.head(n=3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [28]:
#6. Write a Pandas program to insert a column at a specific index in a given
#DataFrame.

df = pd.DataFrame({'One': [1, 1], 'Two': [3, 4]})
print(df.head())
df.insert(2,'Zero',[0,0])
df.head()

   One  Two
0    1    3
1    1    4

   One  Two  Zero
0    1    3     0
1    1    4     0

In [36]:
#7. Write a Pandas program to print a DataFrame without index.

df = pd.DataFrame({'One': [1, 1], 'Two': [3, 4]})
print(df.head())
print(df.to_string(index=False))

   One  Two
0    1    3
1    1    4
 One  Two
   1    3
   1    4

In [40]:
#8. Write a pandas program to find the datatype of each column

nba = pd.read_csv('nba.csv')
print(nba.head())
nba.dtypes

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [42]:
#9. Write a pandas program to convert the csv file to excel

nba = pd.read_csv('nba.csv')
nba.to_excel('nba.xlsx')

In [3]:
#10. Write a Pandas program to detect missing values of a given DataFrame.
#Display True or False.
#Test data saved as test.xlsx.

test = pd.read_excel('test.xlsx')
test.isna()

    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1     True      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4     True      False     False        False        False
5    False      False     False        False        False
6     True      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10    True      False     False        False        False
11   False      False     False        False         True

In [5]:
#11. Write a Pandas program to count the number of missing values in each
#column of above DataFrame (Question 10).

test = pd.read_excel('test.xlsx')
test.isna().sum().sum()

8

In [6]:
#12. Write a Pandas program to drop the rows where at least one element is
#missing in a given DataFrame.

test = pd.read_excel('test.xlsx')
test.dropna(inplace=True)
print(test)

    ord_no  purch_amt   ord_date  customer_id  salesman_id
0  70001.0     150.50 2012-10-05         3002       5002.0
5  70005.0    2400.60 2012-07-27         3001       5001.0
8  70003.0    2480.40 2012-10-10         3003       5003.0
9  70012.0     250.45 2012-06-27         3002       5002.0

In [7]:
#13. Write a Pandas program to replace NaNs with a single constant value in
#specified columns in a DataFrame.

test = pd.read_excel('test.xlsx')
test.fillna(value=1, inplace=True)
print(test)

     ord_no  purch_amt             ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05 00:00:00         3002       5002.0
1       1.0     270.65  2012-09-10 00:00:00         3001       5003.0
2   70002.0      65.26                    1         3001       5001.0
3   70004.0     110.50  2012-08-17 00:00:00         3003          1.0
4       1.0     948.50  2012-09-10 00:00:00         3002       5002.0
5   70005.0    2400.60  2012-07-27 00:00:00         3001       5001.0
6       1.0    5760.00  2012-09-10 00:00:00         3001       5001.0
7   70010.0    1983.43  2012-10-10 00:00:00         3004          1.0
8   70003.0    2480.40  2012-10-10 00:00:00         3003       5003.0
9   70012.0     250.45  2012-06-27 00:00:00         3002       5002.0
10      1.0      75.29  2012-08-17 00:00:00         3001       5003.0
11  70013.0    3045.60  2012-04-25 00:00:00         3001          1.0

In [15]:
#14. Write a Pandas program to add leading zeros to the integer column in a
#pandas series and makes the length of the field to 8 digit.

series = pd.Series(data=[1,2,3,4,5])
zeroed = series.apply(lambda x: str(x).zfill(8))
print(zeroed)

0    00000001
1    00000002
2    00000003
3    00000004
4    00000005
dtype: object

In [3]:
#15. Write a Pandas program to check whether only numeric values present in a
#given column of a DataFrame

test = pd.read_excel('test.xlsx')
print(test.head())
col = pd.Series(test['customer_id'],dtype=str)
col.str.isnumeric()

    ord_no  purch_amt   ord_date  customer_id  salesman_id
0  70001.0     150.50 2012-10-05         3002       5002.0
1      NaN     270.65 2012-09-10         3001       5003.0
2  70002.0      65.26        NaT         3001       5001.0
3  70004.0     110.50 2012-08-17         3003          NaN
4      NaN     948.50 2012-09-10         3002       5002.0

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
Name: customer_id, dtype: bool

In [8]:
#16. Write a Pandas program to display the default index and set a column as an
#Index in a given dataframe
#Test data saved as test2.xlsx

test2 = pd.read_excel('test2.xlsx')
test2.set_index(0, inplace=True)
test2.head()

   s001   V Alberto   Franco  15/05/2002  35  street1  t1
0
1  s002   V    Gino  Mcneill  17/05/2002  32  street2  t2
2  s003  VI    Ryan   Parkes  16/02/1999  33  street3  t3
3  s001  VI   Eesha   Hinton  25/09/1998  30  street1  t4
4  s002   V    Gino  Mcneill  11/05/2002  31  street2  t5
5  s004  VI   David   Parkes  15/09/1997  32  street4  t6

In [10]:
#17. Write a Pandas program to create a dataframe and set a title or name of the
#index column.

test2 = pd.read_excel('test2.xlsx')
test2.set_index(0, inplace=True)
test2.index.name = 'Index'
test2.head()

       s001   V Alberto   Franco  15/05/2002  35  street1  t1
Index
1      s002   V    Gino  Mcneill  17/05/2002  32  street2  t2
2      s003  VI    Ryan   Parkes  16/02/1999  33  street3  t3
3      s001  VI   Eesha   Hinton  25/09/1998  30  street1  t4
4      s002   V    Gino  Mcneill  11/05/2002  31  street2  t5
5      s004  VI   David   Parkes  15/09/1997  32  street4  t6

In [14]:
#18. Write a Pandas program to select a specific row of given series/dataframe by
#integer index.

test2 = pd.read_excel('test2.xlsx')
test2.set_index(0, inplace=True)
test2.index.name = 'Index'
spec = test2.iloc[1]
spec

s001                s003
V                     VI
Alberto             Ryan
Franco            Parkes
15/05/2002    16/02/1999
35                    33
street1          street3
t1                    t3
Name: 2, dtype: object

In [24]:
#19. Write a Pandas program to find the indexes of rows of a specified value of a
#given column in a DataFrame.

test2 = pd.read_excel('test2.xlsx')
print(test2.head())
s2 = test2.index[test2['street1']=='street2'].tolist()
s2

   0  s001   V Alberto   Franco  15/05/2002  35  street1  t1
0  1  s002   V    Gino  Mcneill  17/05/2002  32  street2  t2
1  2  s003  VI    Ryan   Parkes  16/02/1999  33  street3  t3
2  3  s001  VI   Eesha   Hinton  25/09/1998  30  street1  t4
3  4  s002   V    Gino  Mcneill  11/05/2002  31  street2  t5
4  5  s004  VI   David   Parkes  15/09/1997  32  street4  t6

[0, 3]

In [21]:
#20. Write a Pandas program to find integer index of rows with missing data in a
#given dataframe.

test = pd.read_excel('test.xlsx')
missing = test.index[test.isna().any(axis=1)].tolist()
print(missing)

[1, 2, 3, 4, 6, 7, 10, 11]